---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.Dispose
source: html/ba92460c-c6d3-7b6e-4159-ac6a88978d86.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.Dispose Method

Releases all resources used by the IFCExtrusionData

## Syntax (C#)
```csharp
public void Dispose()
```